grimreaper/freebsd9-documentation/doc/ja_JP.eucJP/man/man4/fxp.4
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: fxp.4,v 1.6 1998/03/12 07:30:32 charnier Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/fxp.4,v 1.2 2001/05/14 01:09:10 horikawa Exp $
.\"
.Dd January 19, 1997
.Dt FXP 4 i386
.Os FreeBSD
.Sh 名称
.Nm fxp
.Nd
Intel EtherExpress Pro/100B イーサネットデバイスドライバ
.Sh 書式
.Cd "device fxp0"
.Sh 解説
.Nm
ドライバは Intel i82557 イーサネットチップを搭載した EtherExpress
Pro/10 と Pro/100B PCI ファーストイーサネットアダプタの
サポートを提供します。
.Pp
.Nm
ドライバは次のメディアタイプをサポートします:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It autoselect
メディアタイプとオプションを自動選択します
.It 10baseT/UTP
10Mbps に設定します
.It 100baseTX
100Mbps (ファーストイーサネット) に設定します
.El
.Pp
.Nm
ドライバは次のメディアオプションをサポートします:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It full-duplex
全二重通信に設定します
.El
.Pp
メディアタイプ 100baseTX は Pro/100B のみ可能です。
このデバイスの設定に関するさらなる情報は
.Xr ifconfig 8
を参照してください。
.Sh 診断
.Bl -diag
.It "fxp%d: couldn't map memory"
致命的な初期化エラーが発生しました。
.It "fxp%d: couldn't map interrupt"
致命的な初期化エラーが発生しました。
.It "fxp%d: Failed to malloc memory"
割り当てるための mbuf が十分にはありません。
.It "fxp%d: device timeout"
デバイスはネットワークに対しての応答を停止しているか、
またはネットワークの接続 (ケーブル) に問題があります。
.El
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 , 
.Xr ifconfig 8
.Sh 歴史
.Nm
デバイスドライバは
.Fx 2.1
に初めて登場しました。
.Sh 作者
.Nm
デバイスドライバは
.An David Greenman
が書きました。
このマニュアルページは
.An David E. O'Brien
が書きました。
