grimreaper/freebsd9-documentation/doc/ja_JP.eucJP/man/man4/ssc.4
.\"	%Id: ssc.4,v 1.2 1998/08/31 16:41:07 wosch Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/ssc.4,v 1.2 2001/05/14 01:09:14 horikawa Exp $
.\"
.\" Copyright (c) 1997 Brian Somers <brian@Awfulhak.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 29, 1997
.Dt SSC 4
.Os FreeBSD
.Sh 名称
.Nm ssc
.Nd `スーパ SCSI' ドライバ
.Sh 書式
.Cd "pseudo-device ssc"
.Sh 解説
.Nm
ドライバは、以前に SCSI デバイスが 1 つも検出されなかった場合に使用される
アクセスポイントを、SCSI ドライバのコード内部に提供します。これは、外部 
SCSI デバイスしか持っていないシステムにとっては便利なものです。こうした
SCSI デバイスはブート時に電源が切れているかもしれないからです。
.Pp
.Sq scsi user
、すなわち
.Xr su 4
疑似デバイスが
.Nm ssc
には使われるため、su デバイスも設定していなくてはなりません。
.Sh カーネルの設定
ssc 疑似デバイスには、設定パラメータはありません。
.Pp
.Sh IOCTL
.Nm
ドライバは、ただ 1 つ自分自身の
.Dv SCIOCADDR
を持っています。この ioctl は、
.Pa /dev/ssc
をオープンした後に使用しなくてはなりません。また、この ioctl よりも前に
他の ioctl コールを発行してはいけません:
.Bd -literal -offset indent
.Fd #include <sys/scsiio.h>

.Ft int
.Fn ioctl "int fd" "SCIOCADDR" "struct scsi_addr *data"
.Ed
.Pp
.Ar fd
は、
.Xr open 2
が返す識別子を表し、
.Ar data
は要求に合わせて設定された
.Ar scbus ,
.Ar target ,
.Ar lun
フィールドを持っていなくてはなりません。この ioctl は、次に呼ばれる ioctl が
影響を与えるデバイスを任意に変更するために使用できます。
.Pp
その他の ioctl はすべて直接
.Xr su 4
疑似デバイスドライバに渡されます。その際、最新の
.Dv SCIOCADDR
ioctl コールで設定された Bus, Target, Lun フィールドを使用します。
.Sh 関連ファイル
.Bl -tag -width /dev/ssc -compact
.It Pa /dev/ssc
.Sq スーパ SCSI
ドライバをアクセスするのに使われるデバイスファイルです。
.El
.Sh 診断
.Dv SCIOCADDR
ioctl を発行するよりも前に別の ioctl を発行しようとすると、
.Dv ENXIO
が返されます。そうでない場合は、該当の ioctl は直接
.Xr su 4
ドライバに送られます。
.Sh 関連項目
.Xr open 2 ,
.Xr su 4 ,
.Xr scsi 8
.Sh 歴史
.Nm
は、最初に FreeBSD 2.0.5 で登場しました。
