grimreaper/freebsd9-documentation/branches/freebsd9/doc/ja_JP.eucJP/man/man4/tx.4
.\"
.\" Copyright (c) 1998 Semen Ustimenko
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/tx.4,v 1.3 2004/07/11 11:15:53 metal Exp $
.Dd January 28, 1997
.Dt TX 4 i386
.Os FreeBSD
.Sh 名称
.Nm tx
.Nd
SMC9432TX ファーストイーサネットデバイスドライバ
.Sh 書式
.Cd "device tx0"
.Sh 解説
.Nm
デバイスドライバは SMC 83c170 (EPIC) を利用したイーサネットアダプタを
サポートしています。
.Pp
.Nm
ドライバは以下に挙げるメディアタイプをサポートしています:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxx
.It autoselect
自動判別を有効にします (デフォルト) 
.It 100baseTX
100Mbps (ファーストイーサネット) による転送を利用します
.It 10baseT/UTP
10BaseT ポートでの 10Mbps による転送を利用します
.El
.Pp
.Nm
ドライバは以下に挙げるメディアオプションをサポートしています:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxx
.It full-duplex
全二重による転送を利用します
.El
.Pp
以前の ``ifconfig tx0 linkN'' による設定はサポートされていません。
.Sh 診断
.Bl -diag
.It "tx%d: device timeout %d packets"
デバイスは、応答するのを中止しました。
このエラーの後、デバイスとドライバはリセットされます。
.It "tx%d: PCI fatal error occured (%s)"
次にあげるエラーのうちどれかひとつが発生しました: PCI Target Abort,
PCI Master Abort, Data Parity Error, Address Parity Error。
このエラーの後、デバイスとドライバはリセットされます。
.It "tx%d: WARNING! no link established"
メディアが接続されていません。
起動時にのみ表示されます。
.It "tx%d: cannot allocate mbuf header/cluster"
受信パケットのためのメモリを用意できません。
パケットは破棄されます。
.\" Revision 1.5.2.2 では packet thrown away に修正されている
.\" Dec 31 1999, <horikawa@jp.FreeBSD.org>
.It "tx%d: can't stop %s DMA"
リセットを行っている間に、
ドライバはデバイスを正常に停止させることができませんでした。
.El
.Sh バグ
.Pp
マルチキャストパケットフィルタリングは、サポートしていません。
ひとつの PHY (Quality Semiconductor QS6612) のみ、実際にテストしました。
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
