grimreaper/freebsd9-documentation/branches/freebsd9/doc/ja_JP.eucJP/man/man4/vpo.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/vpo.4,v 1.2 2001/05/14 01:09:15 horikawa Exp $
.Dd March 5, 1998
.Dt VPO 4
.Os FreeBSD
.Sh 名称
.Nm vpo
.Nd
パラレルから SCSI へのインタフェースドライバ
.Sh 書式
.Cd "controller vpo at ppbus?"
.Pp
1 つ以上の SCSI バスに対し:
.Cd "controller scbus0 at vpo0"
.Sh 解説
.Em vpo
ドライバの第 1 の目的は、
Iomega ZIP ドライブに組み込まれた Adaptec AIC-7110 SCSI コントローラへの
アクセスを提供することです。
しかし、Iomega Jaz Traveller のパラレルから SCSI へのインタフェースでも
動作するでしょう。
.Sh 関連項目
.Xr ppbus 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
で初めて登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
