grimreaper/freebsd9-documentation/branches/freebsd9/doc/ja_JP.eucJP/man/man4/zp.4
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: zp.4,v 1.5 1998/10/22 14:12:55 bde Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/zp.4,v 1.2 2001/05/14 01:09:15 horikawa Exp $
.\"
.Dd January 19, 1997
.Dt ZP 4 i386
.Os FreeBSD
.Sh 名称
.Nm zp
.Nd
3Com PCMCIA Etherlink III イーサネットデバイスドライバ
.Sh 書式
.Cd "device zp0 at isa? port 0x300 net irq 10 iomem 0xd8000"
.Sh 解説
.Nm
ドライバは
3Com 3C589 PCMCIA Etherlink III イーサネットコントローラの
サポートを提供します。
.Pp
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh 歴史
.Nm
デバイスドライバは
.Fx 2.0.5
で初めて登場しました。
.Sh 作者
.Nm
デバイスドライバは
.An Tatsumi Hosokawa
が書きました。
これは、
.An Herb Peyerl ,
.An Devid Hinds ,
.An Donald Becker ,
.An David Greenman ,
.An Seiji Murata
によるイーサネットドライバのコードに基づいています。
このマニュアルページは
.An David E. O'Brien
が書きました。
