grimreaper/freebsd9-documentation/branches/gcin2011/doc/ja_JP.eucJP/man/man9/VFS_CHECKEXP.9
.\"
.\" Copyright (c) 1999 Alfred Perlstein
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following condition
.\" is met:
.\"    Redistributions of source code must retain the above copyright
.\"    notice, this condition and the following disclaimer.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_CHECKEXP.9,v 1.11.4.1 2005/01/10 23:51:38 keramida Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/VFS_CHECKEXP.9,v 1.11 2005/07/11 13:46:23 metal Exp $
.Dd January 7, 2005
.Os
.Dt VFS_CHECKEXP 9
.Sh 名称
.Nm VFS_CHECKEXP
.Nd ファイルシステムがクライアントにエクスポートされているかどうかのチェック
.Sh 書式
.In sys/param.h
.In sys/mount.h
.Ft int
.Fn VFS_CHECKEXP "struct mount *mp" "struct sockaddr *nam" "int *exflagsp" "struct ucred **credanonp"
.Sh 解説
.Fn VFS_CHECKEXP
マクロは、クライアントにマウントポイントがエクスポート
されているかどうかをチェックするために、NFS サーバが使用します。
.Pp
引数は以下の通りです。
.Bl -tag -width credanonp
.It Fa mp
チェック対象のマウントポイント。
.It Fa nam
クライアントのネットワークアドレスを含む mbuf。
.It Fa exflagsp
このクライアントに対する、エクスポートフラグの戻り値。
.It Fa credanonp
このクライアントに対する、匿名の証明の戻り値。
.El
.Pp
.Fn VFS_CHECKEXP
マクロは、ファイルシステムのマウント構造に対して呼び出して、
.Fa nam
にアドレスが含まれるクライアントに対してそのファイルシステムが
エクスポートされているかどうかを決定できます。
.Pp
一般的には、
クライアントがファイルシステムにアクセス可能かを確認するために、
.Xr VFS_FHTOVP 9
の前に呼び出されます。
.Pp
ファイルシステムは、
クライアントがファイルシステムをアクセスできるかを実証するために、
.Vt netexport
構造体の適切なアドレス、クライアントのアドレス、および
.Fa nam
を伴って、
.Xr vfs_export_lookup 9
を呼び出すべきです。
.Sh 戻り値
そのクライアントに対するエクスポートフラグと
.Pf ( Xr vfs_export_lookup 9
から返される) 匿名の証明が
.Fa *exflagsp
と
.Fa *credanonp
に返されるでしょう。
.Sh 関連項目
.Xr VFS 9 ,
.Xr VFS_FHTOVP 9 ,
.Xr VFS_VPTOFH 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Alfred Perlstein
によって書かれました。
