grimreaper/freebsd9-documentation/doc/ja_JP.eucJP/man/man8/setfsmac.8
.\" Copyright (c) 2003, 2004 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" This software was developed for the FreeBSD Project by Chris Costello
.\" at Safeport Network Services and Network Associates Labs, the
.\" Security Research Division of Network Associates, Inc. under
.\" DARPA/SPAWAR contract N66001-01-C-8035 ("CBOSS"), as part of the
.\" DARPA CHATS research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/setfmac/setfsmac.8,v 1.5 2004/07/02 23:12:56 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/setfsmac.8,v 1.3 2004/10/10 08:30:48 metal Exp $
.Dd February 17, 2004
.Os
.Dt SETFSMAC 8
.Sh 名称
.Nm setfsmac
.Nd ファイル階層に対する MAC ラベルの設定
.Sh 書式
.Nm
.Op Fl ehqvx
.Oo Fl f Ar specfile Oc ...
.Oo Fl s Ar specfile Oc ...
.Ar
.Sh 解説
.Nm
ユーティリティは、入力として仕様ファイルのリストを受け取り、
指定されたファイルシステム階層に対して MAC ラベルを設定します。
指定されたパス名は、コマンド行で指定された順番に処理され、
各ツリーは前順序 (pre-order) で巡回されます
(一般的には、
絶対パスの代りに相対パスを使ってもあまり有用ではないでしょう)。
あるファイルにマッチするラベルは、組み合わせて一括設定されます。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.It Fl e
MAC ラベルをサポートしないファイルシステムに出会うと、
警告してスキップするのではなく、
エラーにします。
.It Fl f Ar specfile
.Ar specfile
中の仕様を、指定されたパスに適用します。
.\" XXX
.Bf -emphasis
注: 各ファイルの最初のエントリのみが適用されます。
他のすべては無視され、黙って捨てられます。
.Ef
複数の
.Fl f
引数を指定することで、複数の仕様ファイルをインクルード可能です。
.It Fl h
シンボリックリンクに出会うと、リンクが指すファイルの代りに、
リンクそのもののラベルを変更します。
.It Fl q
実行中、致命的でない警告は表示しません。
.It Fl s Ar specfile
.Ar specfile
中の仕様を適用しますが、仕様書式は
SELinux
の
.Ar specfile
であるものと仮定されます
.\" XXX
.Bf -emphasis
注: 各ファイルの最初のエントリのみが適用されます。
他のすべては無視され、黙って捨てられます。
.Ef
.Ar specfile
中のラベルに対し、プレフィックス
.Dq Li sebsd/
が自動的に付けられます。
.Dq Li <<none>>
にマッチするラベルは明示的に再ラベルされません。
これにより、
SEBSD
において、既存の
SELinux
ポリシ仕様ファイルを無修正で再利用可能になります。
.It Fl v
冗長性を増加させます。
.It Fl x
ファイルシステム巡回中に、新規ファイルシステムへは入りません。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa /usr/share/security/lomac-policy.contexts" -compact
.It Pa /usr/share/security/lomac-policy.contexts
LOMAC ポリシエントリを含む、サンプルの仕様ファイル
.El
.Sh 使用例
.Sx 関連ファイル
節を参照してください。
.Sh 作者
このソフトウェアは、
Network Associates Labs,
the Security Research Division of Network Associates Inc.
が、DARPA CHATS 研究プログラムの一部として、
DARPA/SPAWAR 契約 N66001-01-C-8035
.Pq Dq CBOSS
のもとに、
.Fx
Project に寄贈しました。
.Sh 関連項目
.Xr mac 3 ,
.Xr mac_set_file 3 ,
.Xr mac_set_link 3 ,
.Xr mac 4 ,
.Xr re_format 7 ,
.Xr getfmac 8 ,
.Xr setfmac 8 ,
.Xr mac 9
