grimreaper/freebsd9-documentation/branches/freebsd9/doc/ja_JP.eucJP/man/man2/kldsym.2
.\" Copyright (c) 2001 Chris Costello <chris@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libc/sys/kldsym.2,v 1.6 2002/12/19 09:40:25 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man2/kldsym.2,v 1.7 2005/07/11 12:51:39 metal Exp $
.Dd July 26, 2001
.Dt KLDSYM 2
.Os
.Sh 名称
.Nm kldsym
.Nd KLD 内のシンボル名による検索
.Sh ライブラリ
.Lb libc
.Sh 書式
.In sys/param.h
.In sys/linker.h
.Ft int
.Fn kldsym "int fileid" "int command" "void *data"
.Sh 解説
.Fn kldsym
システムコールは、
.Fa fileid
で指定されたモジュールにおける
.Fa data
で指定されたシンボルのアドレスを返します。
.Fa fileid
が 0 の場合、すべてのロードされているモジュールが検索されます。
現在、実装されている
.Fa command
は
.Dv KLDSYM_LOOKUP
のみです。
.Pp
.Fa data
引数は、次の構造体です:
.Pp
.Bd -literal -offset indent
struct kld_sym_lookup {
    int         version;        /* sizeof(struct kld_sym_lookup) */
    char        *symname;       /* 検索対象のシンボル名 */
    u_long      symvalue;
    size_t      symsize;
};
.Ed
.Pp
.Va version
メンバは、
.Fn kldsym
を呼ぶコードによって、
.Fn sizeof "struct kld_sym_lookup"
に設定されるべきです。
次に示す 2 個の引数
.Va version
と
.Va symname
は、ユーザが指定します。
最後の 2 個
.Va symvalue
と
.Va symsize
は、
.Fn kldsym
によって埋められます。
これらは、
.Va symname
に関連付けられたアドレスと、
それの指しているデータの大きさを、それぞれ保持します。
.Sh 戻り値
.Rv -std kldsym
.Sh エラー
.Fn kldsym
システムコールは次の場合に失敗します:
.Bl -tag -width Er
.It Bq Er EINVAL
.Fa data->version
または
.Fa command
の中の値が不正です。
.It Bq Er ENOENT
.Fa fileid
引数が不正であるか、指定したシンボルが見つかりませんでした。
.El
.Sh 関連項目
.Xr kldfind 2 ,
.Xr kldfirstmod 2 ,
.Xr kldload 2 ,
.Xr kldnext 2 ,
.Xr kldunload 2 ,
.Xr modfind 2 ,
.Xr modnext 2 ,
.Xr modstat 2 ,
.Xr kld 4
.Sh 歴史
.Fn kldsym
システムコールは
.Fx 3.0
ではじめて登場しました。
