grimreaper/freebsd9-documentation/trunk/doc/ja_JP.eucJP/man/man9/microuptime.9
.\" Copyright (c) 2000 Kelly Yancey
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"    %FreeBSD: src/share/man/man9/microuptime.9,v 1.5.8.1 2004/09/22 04:43:33 brooks Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/microuptime.9,v 1.6 2004/11/04 01:14:32 metal Exp $
.Dd September, 16 2004
.Dt MICROUPTIME 9
.Os
.Sh 名称
.Nm binuptime ,
.Nm getbinuptime ,
.Nm microuptime ,
.Nm getmicrouptime ,
.Nm nanouptime ,
.Nm getnanouptime
.Nd 起動からの経過時間の取得
.Sh 書式
.In sys/time.h
.Ft void
.Fn binuptime "struct bintime *bt"
.Ft void
.Fn getbinuptime "struct bintime *bt"
.Ft void
.Fn microuptime "struct timeval *tv"
.Ft void
.Fn getmicrouptime "struct timeval *tv"
.Ft void
.Fn nanouptime "struct timespec *ts"
.Ft void
.Fn getnanouptime "struct timespec *tsp"
.Sh 解説
.Fn binuptime
および
.Fn getbinuptime
関数は、
.Fa bt
によって指定されたアドレスに、
.Ft bintime
構造体として、起動からの経過時間を保存します。
.Fn microuptime
および
.Fn getmicrouptime
関数は、同等の機能を果たしますが、代りに
.Ft timeval
構造体として経過時間を記録します。
同様に、
.Fn nanouptime
および
.Fn getnanouptime
関数は、
.Ft timespec
構造体として経過時間を保存します。
.Pp
.Fn binuptime ,
.Fn microuptime ,
.Fn nanouptime
は、常に可能な限り正確な現在時刻を返す時刻カウンタを請求します。
それに反して、
.Fn getbinuptime ,
.Fn getmicrouptime ,
.Fn getnanouptime
関数は、正確ではないが高速に得られる時刻を返す抽象化です。
.Pp
.Fn getbinuptime ,
.Fn getmicrouptime ,
.Fn getnanouptime
関数の意図は、タイマの正確さ対実行時間のユーザの好みを強化することです。
.Sh 関連項目
.Xr bintime 9 ,
.Xr getbintime 9 ,
.Xr getmicrotime 9 ,
.Xr getnanotime 9 ,
.Xr microtime 9 ,
.Xr nanotime 9 ,
.Xr tvtohz 9
.Sh 作者
このマニュアルページは
.An Kelly Yancey Aq kbyanc@posi.net
が書きました。
