grimreaper/freebsd9-documentation/doc/ja_JP.eucJP/man/man9/tvtohz.9
.\" Copyright (c) 2000 Kelly Yancey
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"    %FreeBSD: src/share/man/man9/tvtohz.9,v 1.3 2001/10/01 16:09:25 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/tvtohz.9,v 1.5 2002/11/24 01:43:12 horikawa Exp $
.Dd January 3, 2000
.Dt TVTOHZ 9
.Os
.Sh 名称
.Nm tvtohz
.Nd 時間間隔からティック数への変換
.Sh 書式
.In sys/time.h
.Ft int
.Fn tvtohz "struct timeval *tv"
.Sh 解説
.Fn tvtohz
関数は、時間間隔を示す単一引数
.Fa tv
を受け付けます。
この時間間隔中に、システムティックが何個経過するかを計算します。
.Sh 戻り値
指定された時間間隔中に経過すると予測されるシステムティック数を、
整数で返します。
この数には、現在のティックも含まれます。
.Sh 関連項目
.Xr microtime 9 ,
.Xr microuptime 9 ,
.Xr timeout 9
.Sh 歴史
.Nm
関数は、
.Fx 3.0
で初めて登場しました。
.Sh 作者
このマニュアルページは
.An Kelly Yancey Aq kbyanc@posi.net
が書きました。
