grimreaper/freebsd9-documentation/branches/freebsd9/doc/ja_JP.eucJP/man/man9/BUF_UNLOCK.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/BUF_UNLOCK.9,v 1.6 2001/12/26 23:14:04 davidc Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/BUF_UNLOCK.9,v 1.1 2003/08/17 19:22:33 horikawa Exp $
.Dd July 9, 2001
.Dt BUF_UNLOCK 9
.Os
.Sh 名称
.Nm BUF_UNLOCK
.Nd ロックされたバッファのロック解除
.Sh 書式
.In sys/param.h
.In sys/systm.h
.In sys/uio.h
.In sys/bio.h
.In sys/buf.h
.Ft void
.Fn BUF_UNLOCK "struct buf *bp"
.Sh 解説
.Fn BUF_UNLOCK
関数は以前に
.Fn BUF_LOCK
または
.Fn BUF_TIMELOCK
を用いてロックされたバッファを、ロック解除します。
.Pp
引数は以下の通りです。
.Bl -tag -width ".Fa bp"
.It Fa bp
ロック解除されるべきバッファです。
このバッファは既にロックされていなければなりません。
.El
.Sh 関連項目
.Xr buf 9 ,
.Xr BUF_LOCK 9 ,
.Xr BUF_TIMELOCK 9 ,
.Xr lockmgr 9
.Sh 作者
このマニュアルページは
.An Chad David Aq davidc@acns.ab.ca
が書きました。
