grimreaper/freebsd9-documentation/branches/gcin2011/doc/fr_FR.ISO8859-1/man/man4/ncr.4
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: doc/fr_FR.ISO8859-1/man/man4/ncr.4,v 1.1 2002/09/28 22:03:07 blackend Exp $
.\" $Id: ncr.4,v 1.3 2002/09/28 21:49:32 marc Exp $
.\" Original revision: 1.13
.\"
.Dd July 10, 1996
.Dt NCR 4
.Os
.Sh NAME
.Nm ncr
.Nd Pilote de périphérique SCSI NCR 53C8xx
.Sh SYNOPSIS
.Cd "device ncr"
.Sh DESCRIPTION
Le pilote de périphérique
.Nm
fournit le support pour les contrôleurs SCSI
NCR/Symbios 53C810, 53C810a,
53C815, 53C820, 53C825a, 53C860, 53C875, 53C875j, 53C885,
53C895 et 53C896.
.Sh VOIR AUSSI
.Xr cd 4 ,
.Xr ch 4 ,
.Xr da 4 ,
.Xr intro 4 ,
.Xr sa 4 ,
.Xr scsi 4 ,
.Xr sym 4
