grimreaper/freebsd9-documentation/trunk/doc/ja_JP.eucJP/man/man4/man4.i386/io.4
.\"
.\" Copyright (c) 1996 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: io.4,v 1.5 1997/03/21 20:13:45 mpp Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/man4.i386/io.4,v 1.2 2001/05/14 01:09:12 horikawa Exp $
.\"
.Dd Jan 1, 1996
.Dt IO 4 i386
.Os
.Sh 名称
.Nm io
.Nd I/O 特権ファイル
.Sh 解説
特殊ファイル
.Pa /dev/io
は制御下にあるセキュリティホールで、
.Pq 通常はカーネルの内部コードに予約された
I/O 特権を得ることをプロセスに許可します。
.Pa /dev/io
を開いたファイル記述子を持ったどんなプロセスでも、
フラグレジスタセットの中の
.Em IOPL
ビットを得ることができます。
すなわち、直接 I/O を操作することが許されます。
これは、ハードウェアを直接操作する
ユーザランドのプログラムを書くために役立ちます。
.Pp
アクセス制御全体は
.Pa /dev/io
のファイルアクセスパーミッションによって管理されていますので、
このデバイスに正しいパーミッションを与えるように
注意する必要があります。
読み込み専用のアクセスでさえ、すべての I/O 特権を
与えてしまうことに注意してください。
.Sh ファイル
.Bl -tag -width Pa -compact
.It Pa /dev/io
.El
.Sh 関連項目
.Xr mem 4
.Sh 歴史
.Nm io
ファイルは
.Fx 1.0
で登場しました。



