grimreaper/freebsd9-documentation/doc/ru_RU.KOI8-R/man/man1/truss.1
.\" %FreeBSD: src/usr.bin/truss/truss.1,v 1.24 2007/05/21 20:33:51 keramida Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man1/truss.1,v 1.4 2007/10/30 19:37:15 ru Exp $
.\" $FreeBSD: doc/ru_RU.KOI8-R/man/man1/truss.1,v 1.1 2007/11/20 07:16:12 ru Exp $
.\"
.Dd 2 января 2004
.Dt TRUSS 1
.Os
.Sh НАЗВАНИЕ
.Nm truss
.Nd отслеживать системные вызовы
.Sh СИНТАКСИС
.Nm
.Op Fl faedDS
.Op Fl o Ar файл
.Op Fl s Ar размер
.Fl p Ar pid
.Nm
.Op Fl faedDS
.Op Fl o Ar файл
.Op Fl s Ar размер
.Ar команда Op Ar аргументы
.Sh ОПИСАНИЕ
Утилита
.Nm
отслеживает системные вызовы, производимые указанным процессом или программой.
Вывод направляется в указанный выходной файл или (по умолчанию) в стандартный
файл ошибок.
Отслеживание производится остановкой и перезапуском отслеживаемого
процесса через
.Xr ptrace 2 .
.Pp
Имеются следующие опции:
.Bl -tag -width indent
.It Fl f
Отслеживать потомков начального отслеживаемого процесса, созданных с помощью
.Xr fork 2 ,
.Xr vfork 2 ,
и т.д.
.It Fl a
Показывать строки аргументов, передаваемые в каждом системном вызове
.Xr execve 2 .
.It Fl e
Показывать строки окружения, передаваемые в каждом системном вызове
.Xr execve 2 .
.It Fl d
Включить в вывод метки времени, прошедшего с начала отслеживания.
.It Fl D
Включить в вывод метки времени, прошедшего с последнего
зафиксированного события.
.It Fl S
Не выводить информацию о сигналах, полученных процессом.
(Обычно
.Nm
выводит как системные вызовы, так и сигналы.)
.It Fl o Ar файл
Направить вывод в указанный
.Ar файл
вместо стандартного файла ошибок.
.It Fl s Ar размер
Выводить строки, используя максимум
.Ar размер
символов.
Если буфер окажется больше, в конце строки выведется
.Dq Li ... .
По умолчанию
.Ar размер
равен 32.
.It Fl p Ar pid
Отслеживать процесс с указанным номером вместо новой команды.
.It Ar команда Op Ar аргументы
Выполнить команду и отслеживать её системные вызовы.
(Опции
.Fl p
и
.Ar команда
взаимно исключительны.)
.El
.Sh ПРИМЕРЫ
# Отследить системные вызовы используемые при выводе "hello"
.Dl $ truss /bin/echo hello
# То же самое, но направить вывод в файл
.Dl $ truss -o /tmp/truss.out /bin/echo hello
# Отследить уже запущенный процесс
.Dl $ truss -p 1
.Sh СМОТРИ ТАКЖЕ
.Xr kdump 1 ,
.Xr ktrace 1 ,
.Xr ptrace 2
.Sh ИСТОРИЯ
Команду
.Nm
для
.Fx
написал
.An Sean Eric Fagan .
Она была смоделирована по похожим командам в System V Release 4 и SunOS.
