grimreaper/freebsd9-documentation/trunk/doc/ja_JP.eucJP/man/man4/bridge.4
.\"
.\"     %Id: bridge.4,v 1.2 1998/12/21 22:37:53 luigi Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/bridge.4,v 1.2 2001/05/14 01:09:09 horikawa Exp $
.\"
.Dd Sep 28, 1998
.Dt BRIDGE 4
.Os
.Sh 名称
.Nm bridge
.Nd ブリッジのサポート
.Sh 解説
バージョン 2.2.8 からは、 FreeBSD はイーサネット型インタフェースでの
ブリッジをサポートします。
これはカーネル設定ファイルで次のオプションを使うことで実現されます。
.Bd -literal
    options BRIDGE
.Ed

そして 2 つの
.Nm sysctl
変数で制御されます:
.Bd -literal
    net.link.ether.bridge
.Ed

ブリッジを有効にするには 1 に設定し、無効にするには 0 に設定してください。
.Bd -literal
    net.link.ether.bridge_ipfw
.Ed


ブリッジされたパケットに対して
.Nm ipfw
フィルタリングを有効にするには 1 に設定してください。
.Nm ipfw
ルールは IP パケットに対してのみ適用されることに注意してください。
IP 以外のパケットはデフォルトの
.Nm ipfw
ルール(65535番)に従います。
ARP やその他の IP 以外のパケットがブリッジを通り抜けるようにしたい場合には、
これは
.Ar allow
ルールでなければなりません。


.Sh バグ
.Pp
ブリッジのトポロジにループを作らないように気を付けねばなりません。
カーネルは、ループを検出したときにいくつかのインタフェースを無効にする、
原始的な形のループ検出機構しかサポートしていません。
スパニングツリーアルゴリズムを実現するデーモンのためのサポートは、
今のところ用意されていません。
.Pp
ブリッジを有効にすると、インタフェースは無差別(promiscuous)モードになるので、
望ましくない通信を受信しフィルタではじく分、システムに負荷をかけます。
.Pp
インタフェースのクラスタについて選択的にブリッジを有効にする拡張機能
については、まだ作業中です。
.Pp
すべてのインタフェースがブリッジをサポートしているわけではありません。
現在 ``ed'', ``de'', ``ep'', ``fxp'', ``lnc'' インタフェースで動作します。
.Sh 関連項目
.Xr ip 4 ,
.Xr ipfw 8 ,
.Xr sysctl 8
.Sh 歴史
.Nm
によるブリッジは FreeBSD 2.2.8 で
Luigi Rizzo <luigi@iet.unipi.it> により導入されました。
