grimreaper/freebsd9-documentation/trunk/doc/ja_JP.eucJP/man/man4/iic.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/iic.4,v 1.2 2001/05/14 01:09:12 horikawa Exp $
.Dd October 25, 1998
.Dt IIC 4
.Os FreeBSD
.Sh 名称
.Nm iic
.Nd
I2C 汎用 I/O デバイスドライバ
.Sh 書式
.Cd "device iic0 at iicbus?"
.Sh 解説
.Em iic
キャラクタデバイスドライバは、
.Xr iicbus 4
の実体に対し、汎用の I/O を提供します。
I2C デバイスを制御するためには、
次の ioctl を /dev/iic? に使用します。
.Pp
.Bl -column "ioctls" -compact
.It Em Ioctl Ta Em 解説
.It Sy I2CSTART Ta "バス上の (7 ビットアドレスで) 指定されたデバイスに開始状態を送る"
.It Sy I2CSTOP Ta "バスに停止状態を送る"
.It Sy I2CRSTCARD Ta "バスをリセットする"
.El
.Pp
読み出し/書き込みルーチンも使用することができ、
その場合は I2C の開始/停止のハンドシェークは
iicbus システムによって管理されます。
.Pp
.Sh 関連項目
.Xr iicbus 4
.Sh 歴史
.Nm
のマニュアルページは
.Fx 3.0
で登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
