grimreaper/freebsd9-documentation/trunk/doc/ja_JP.eucJP/man/man4/worm.4
.\" 
.\" Copyright (C) 1996
.\"   interface business GmbH
.\"   Tolkewitzer Strasse 49
.\"   D-01277 Dresden
.\"   F.R. Germany
.\"
.\" All rights reserved.
.\"
.\" Written by Joerg Wunsch <joerg_wunsch@interface-business.de>
.\"
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
.\" OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
.\" BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
.\" LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE
.\" USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %Id: worm.4,v 1.17 1998/10/16 00:26:23 ken Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man4/worm.4,v 1.2 2001/05/14 01:09:15 horikawa Exp $
.\" WORD FreeBSD ports collection	FreeBSD ports コレクション (ports.7)
.\" "
.Dd October 15, 1998
.Dt WORM 4
.Os FreeBSD
.Sh 名称
.Nm worm
.Nd 1 回書き込み型 (CD-R) ディスクドライバ
.Sh 書式
ありません。
.Sh 解説
.Nm worm
ドライバは
.Fx 3.0
以前の FreeBSD リリースで提供されていました。
.Pp
FreeBSD の
.Tn SCSI
レイヤは
.Fx 3.0
では CAM に従った
.Tn SCSI
レイヤに置き換えられました。
新しい
.Tn SCSI
レイヤは
.Xr worm 4
ドライバを含んでいませんし、将来も含まないでしょう。
おそらく、将来 CD-R/CD-RW/DVD ドライブのカーネル内サポートが
.Xr cd 4
ドライバを通じて実装されるでしょう。
WORM, CD-R, CD-RW のドライブで CD に書き込みをしたいユーザは、
.Nm cdrecord
を使ってください。これは FreeBSD ports コレクションに含まれています。
.Pp
.Xr cd 4 
ドライバは CD, CD-R, CD-RW のドライブへの読み込み専用の
アクセスを提供しています。
これは CDROM コマンドセットをサポートした WORM ドライブも同様です。
ですから、WORM ドライブ中の CD をマウントしたいユーザは、
代わりに
.Xr cd 4
ドライバを使ってください。
.Sh 関連項目
.Xr close 2 ,
.Xr ioctl 2 ,
.Xr open 2 ,
.Xr write 2 ,
.Xr cd 4 ,
.Xr pass 4 ,
.Xr xpt 4
.Sh 作者
.Nm
ドライバの最初の骨組みは
.An Peter Dufault
が 1995 年 5 月に書きました。
その後 1996 年 1 月に
.ie t J\(:org Wunsch
.el Joerg Wunsch
が改良して実際に使えるようになりました。
.Sh 歴史
.Nm
ドライバは
.Fx 2.1
に登場して、
.Fx 3.0
で CAM 
.Tn SCSI
レイヤが登場したのにともなってなくなりました。
