grimreaper/freebsd9-documentation/branches/gcin2011/doc/ja_JP.eucJP/man/man8/kldxref.8
.\"-
.\" Copyright (c) 2001 Boris Popov
.\" Copyright (c) 2001 Dag-Erling Coidan Smorgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/kldxref/kldxref.8,v 1.8 2004/06/01 09:34:04 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/kldxref.8,v 1.5 2005/07/30 18:17:01 hrs Exp $
.Dd October 9, 2001
.Dt KLDXREF 8
.Os
.Sh 名称
.Nm kldxref
.Nd カーネルローダ用のヒントの生成
.Sh 書式
.Nm
.Op Fl Rdv
.Op Fl f Ar hintsfile
.Ar path ...
.Sh 解説
.Nm
ユーティリティは、ヒントファイルの生成に使用されます。
ヒントファイルには、モジュール、モジュールのバージョン、
モジュールを含むファイルを列挙します。
これらのヒントはカーネルローダが使用し、
特定の KLD モジュールをどこから見付けるかを決定します。
.Pp
コマンド行には、モジュールが含まれるディレクトリを指定します。
ディレクトリ毎に、別々のヒントファイルが生成されます。
あるディレクトリに対してヒントレコードがなにも無い場合、
ヒントファイルは生成されず、
既存のヒントファイルは (当該ディレクトリにあれば) 削除されます。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.It Fl R
サブディレクトリに対して再帰実行します。
.It Fl d
ヒントファイルを生成せず、モジュールメタデータを標準出力へ表示します。
.It Fl f Ar hintsfile
.Pa linker.hints
以外のヒントファイル名を指定します。
.It Fl v
冗長モードで動作します。
.El
.Sh 使用例
標準モジュールと追加モジュールの両方に対してヒントファイルを構築します:
.Pp
.Dl "kldxref /boot/kernel /boot/modules"
.Pp
すべてのインストール済のカーネルに対してヒントファイルを構築します:
.Pp
.Dl "kldxref -R /boot"
.Sh 関連項目
.Xr kld 4 ,
.Xr kldconfig 8 ,
.Xr kldload 8 ,
.Xr kldstat 8 ,
.Xr kldunload 8
.Sh 歴史
.Nm
ユーティリティが最初に登場したのは
.Fx 5.0
です。
.Sh 作者
.An -nosplit
.Nm
ユーティリティを実装したのは
.An Boris Popov Aq bp@FreeBSD.org
です。
このマニュアルページを書いたのは
.An Boris Popov Aq bp@FreeBSD.org
と
.An Dag-Erling Sm\(/orgrav Aq des@FreeBSD.org
です。
