grimreaper/freebsd9-documentation/branches/freebsd9/doc/ja_JP.eucJP/man/man5/publickey.5
.\" %FreeBSD: src/lib/libc/rpc/publickey.5,v 1.7 2003/08/26 15:52:47 eivind Exp %
.\" @(#)publickey.5	2.1 88/08/07 4.0 RPCSRC; from 1.6 88/02/29 SMI;
.\" $FreeBSD: doc/ja_JP.eucJP/man/man5/publickey.5,v 1.10 2004/07/17 22:45:20 metal Exp $
.\"
.\" WORD: public key	公開鍵
.\" WORD: secret key	秘密鍵
.\"
.Dd October 19, 1987
.Dt PUBLICKEY 5
.Os
.Sh 名称
.Nm publickey
.Nd "公開鍵データベース"
.Sh 書式
.Pa /etc/publickey
.Sh 解説
.Pa /etc/publickey
は、安全な RPC (リモートプロシージャコール)
で用いられる公開鍵のデータベースです。
このデータベースは、ネットワークユーザ名 (これは、ユーザまたは
ホスト名を指します)、ユーザの公開鍵 (16 進表現)、コロン、ログイン
パスワードで暗号化されたユーザの秘密鍵 (16 進表現) を順につなげた
ものからなります。
.Pp
ユーザは
.Xr chkey 1
コマンドを使って、システム管理者は
.Xr newkey 8
コマンドを使ってこのファイルを更新します。
ファイル
.Pa /etc/publickey
には、NIS マスタマシン上のデータだけを置くべきです。
このマシン上で、この
ファイルは変換されて
.Tn NIS
データベース
.Pa publickey.byname
の中に置かれます。
.Sh 関連項目
.Xr chkey 1 ,
.Xr publickey 3 ,
.Xr newkey 8 ,
.Xr ypupdated 8
