grimreaper/freebsd9-documentation/trunk/doc/ja_JP.eucJP/man/man8/ktrdump.8
.\"-
.\" Copyright (c) 2002 Chad David
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.bin/ktrdump/ktrdump.8,v 1.6 2004/07/07 19:57:16 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/ktrdump.8,v 1.3 2004/09/24 05:47:39 metal Exp $
.Dd May 5, 2004
.Dt KTRDUMP 8
.Os
.Sh 名称
.Nm ktrdump
.Nd カーネル ktr トレースバッファの表示
.Sh 書式
.Nm
.Op Fl cfqrt
.Op Fl e Ar execfile
.Op Fl m Ar corefile
.Op Fl o Ar outfile
.Sh 解説
.Nm
ユーティリティは、
カーネル ktr トレースバッファをダンプするために使用されます。
.Pp
次のオプションが使用可能です:
.Bl -tag -width ".Fl e Ar execfile"
.It Fl c
各エントリをログした CPU 番号を表示します。
.It Fl f
各エントリをログしたファイルと行番号を表示します。
.It Fl q
静粛モード。
列のヘッダを表示しません。
.It Fl r
絶対タイムスタンプではなく相対タイムスタンプを表示します。
.It Fl t
各エントリのタイムスタンプを表示します。
.It Fl e Ar execfile
シンボル解決のために使用するカーネルイメージです。
デフォルトは、
.Xr getbootfile 3
から返される値です。
.It Fl m Ar corefile
読み込むコアファイルまたはメモリイメージです。
デフォルトは
.Pa /dev/mem
です。
.It Fl o Ar outfile
出力を書き出すファイルです。
デフォルトは標準出力です。
.El
.Sh 関連項目
.Xr ktr 4 ,
.Xr ktr 9
.Sh 歴史
.Nm
ユーティリティは
.Fx 5.0
にはじめて登場しました。
.Sh 作者
.An -nosplit
.Nm
ユーティリティを実装したのは
.An Jake Burkholder Aq jake@FreeBSD.org
です。
.Pp
このマニュアルページを記述したのは
.An Chad David Aq davidc@FreeBSD.org
です。
