grimreaper/freebsd9-documentation/trunk/doc/ja_JP.eucJP/man/man8/newkey.8
.\" @(#)newkey.8 1.3 91/03/11 TIRPC 1.0; from 1.12 90/02/03 SMI;
.\" %FreeBSD: src/usr.bin/newkey/newkey.8,v 1.7 2002/07/14 15:09:10 charnier Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/newkey.8,v 1.10 2002/11/18 06:17:44 horikawa Exp $
.Dd October 12, 1987
.Dt NEWKEY 8
.Os
.Sh 名称
.Nm newkey
.Nd 公開鍵データベースに新しい鍵を作成する
.Sh 書式
.Nm
.Fl h Ar hostname
.Nm
.Fl u Ar username
.Sh 解説
.Nm
ユーティリティは通常、
Network Interface Service
(\s-1NIS\s0)
のマスタマシンのネットワーク管理者によって実行され、
ネットワーク上のユーザとスーパユーザの公開鍵を確立します。
これらの鍵は、安全な RPC または安全な NFS を使用するために必要です。
.Pp
.Nm
ユーティリティは指定された username のログインパスワードの入力をうながし、
指定されたユーザのログインパスワードで暗号化された公開/秘密鍵の組を
.Pa /etc/publickey
に作成します。
.Pp
このプログラムを使用する必要はありません:
ユーザは各自の鍵を
.Xr chkey 1
で作成してもかまいません。
.Sh オプション
.Bl -tag -width indent
.It Fl h Ar hostname
指定されたマシンにおけるスーパユーザの公開鍵を、新規作成します。
指定された hostname の root のパスワードの入力をうながします。
.It Fl u Ar username
指定された username の公開鍵を、新規作成します。
指定された username の NIS パスワードの入力をうながします。
.El
.Sh 関連項目
.Xr chkey 1 ,
.Xr keylogin 1 ,
.Xr publickey 5 ,
.Xr keyserv 8
.Sh 注
Network Information Service
(\s-1NIS\s0)
は、以前 Sun Yellow Pages
(\s-1YP\s0) として知られていました。
両者は、機能的には同一であり、名前だけが変わりました。
